ulims/rru/controllers/RequestController.php

UPDATE `request` SET `determination`=1, `released`=NULL WHERE `id`=255
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {